{
  "Projects": [
    {
      "Description": "Provides the experience of placing virtual furniture in real world using AR",
      "Images": [
        "1_1.png",
        "1_2.png",
        "1_3.png"
      ],
      "Logo": "1_0.png",
      "Longdescription": "<b>AR decor</b> is project about placing virtual furniture's in real world using marker-less AR to address the lack of visual feed before buying furniture. This app was done with the aim to facilitate both the customer and the product seller to be able to see the furniture in real world without being physically available. ",
      "Name": "AR Decor",
      "Role": "Developed the functionality and the flow of the app along with incorporating the analytics to evaluate the usage of app by the clientele",
      "Techstack": [
        "unity",
        "c#",
        "firebase",
        "ar",
        "github"
      ]
    },
    {
      "Description": "Experience feature by feature of Audi cars in AR",
      "Images": [
        "2_1.png",
        "2_2.png",
        "2_3.png"
      ],
      "Logo": "2_0.png",
      "Longdescription": "Project focusing on the  visualization of car’s features and  customize it on the via an application using marker less AR to place and view it in it’s spectacular view",
      "Name": "Audi AR",
      "Role": "Developed the functionality of the app along with the basic clear coat shader using shadergraph and adhered to the design and standards of ford while developing the app features that allow users to customize the card to their needs",
      "Techstack": [
        "unity",
        "firebase",
        "ar",
        "c#",
        "github"
      ]
    },
    {
      "Images": [
        "3_1.png",
        "3_2.png",
        "3_3.png"
      ],
      "Description": "Experience Ford cars like never before with AR!,customize features in real-time, all from the comfort of your space.",
      "Logo": "3_0.png",
      "Longdescription": "Visualizing the magnificence of the ford range of vehicles in AR while allowing users to customize and see significant features.",
      "Name": "Ford AR",
      "Role": "Developed the functionality of the app and adhered to the ford standards in terms of code and UI, Managed the bundling of  each individual car assets  into asset bundles to upload into s3 bucket for on demand usage.",
      "Techstack": [
        "unity",
        "amazons3",
        "ar",
        "c#",
        "github"
      ]
    },
    {
      "Images": [
        "4_1.png",
        "4_2.png",
        "4_3.png"
      ],
      "Description": "STEM simulation for law of proportions",
      "Logo": "4_0.png",
      "Longdescription": "An baking game simulation to demonstrate how law of proportions work for younger audience",
      "Name": "Law of proportions",
      "Role": "Developed the game and core mechanics using the standard library of unity and repeated iteration to verify the usability against younger audience",
      "Techstack": [
        "unity",
        "webgl",
        "js",
        "c#",
        "html",
        "css"
      ]
    },
    {
      "Images": [
        "5_1.png",
        "5_2.png",
        "5_3.png"
      ],
      "Description": "Collect, attack as you ride along route 66 while fixing it",
      "Logo": "5_0.png",
      "Longdescription": "Create in game events that  has a mix of both free, ad-based, paid rewards, with time limit for each of those rewards to retain players",
      "Name": "Route 66",
      "Role": "Developed an in game event system that  allows each event to have individual time constraint and unique rewards and created a data update pathway in Firebase RTDB for updating the expiry time and rewards on the go",
      "Techstack": [
        "unity",
        "firebase",
        "c#",
        "github"
      ]
    },
    {
      "Images": [
        "6_1.png",
        "6_2.png",
        "6_3.png"
      ],
      "Description": "Mastermind game but with a twist of numbers",
      "Logo": "6_0.png",
      "Longdescription": "Iteration of the bulls and cows as a mobile game targeting audiences who are into number puzzle genre",
      "Name": "Hacked Password Puzzle",
      "Role": "Developed the entire game from scratch with power-ups and enticing features such as <ol><li>PVP (passive)</li>,<li>Tournament (passive)</li> <li> Leader-board system which improve  player retention</li><li> Created Custom matchmaking algorithm for PVP</li><li> Animated most of the game in DOTween engine</li></ol>",
      "Techstack": [
        "unity",
        "firebase",
        "c#",
        "github"
      ]
    },
    {
      "Images": [
        "7_1.png",
        "7_2.png",
        "7_3.png"
      ],
      "Description": "Clues to help you find the word but not always",
      "Logo": "7_0.png",
      "Longdescription": "Word puzzle game that entices people to test their vocabulary",
      "Name": "Word Mastermind",
      "Role": "Developed the entire game from the ground up, including power-ups and appealing elements like leaderboards, passive tournaments, and PVP to increase player retention. Created <ol><li>Custom matchmaking algorithm for PVP</li><li> Created Custom handler for english dictionary</li><li> Animated most of the game in DOTween engine</li></ol>",
      "Techstack": [
        "unity",
        "firebase",
        "c#",
        "github"
      ]
    },
    {
      "Images": [
        "8_1.png",
        "8_2.jpg",
        "8_3.jpg"
      ],
      "Description": "Gamified AR tourism app that helps with sustainability",
      "Logo": "8_0.png",
      "Longdescription": "An mobile AR experience that turns sustainable tourism into a fun and rewarding. Using Pokémon Go–style navigation, and immersive AR content.The  Quest system and the ability to earn points, badges, along with the ability to exchange those points real-world rewards like coupons from local businesses. entice and excite the user to engage. By combining exploration, play, and tangible incentives, the app motivates responsible behaviour.",
      "Name": "Gamified AR sustainable tourism",
      "Role": "Developed the entire AR application and the designs from the ground up, Features such as <ul><li>Pokemon GO style map integration</li> <li>Quest systems</li><li>Profile System</li><li> Mock leaderboards</li> <li>Mock reward system</li><li> Markerless target such as Area target</li></ul><br></br>",
      "Techstack": [
        "unity",
        "c#",
        "vuforia",
        "figma",
        "github"
      ]
    }
  ]
}